stock_app/app/controllers/chart_controller.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @period = "Month"
    @stock = Stock.find(params[:id])

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show_half_year
    @period = "Half year"
    @stock = Stock.find(params[:id])

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show_week
    @period = "Week"
    @stock = Stock.find(params[:id])