stock_app/app/controllers/owned_stocks_controller.rb

SELECT 1 AS one FROM "owned_stocks" WHERE "owned_stocks"."stock_id" = ? AND "owned_stocks"."user_id" = ? LIMIT ?  [["stock_id", 1], ["user_id", 3], ["LIMIT", 1]]
---
  def buy
    if OwnedStock.exists?(id: params[:id], user_id: current_user.id)

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def sell
    @owned_stock = OwnedStock.find(params[:id], user_id: current_user.id)

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "owned_stocks" SET "shares_owned" = ?, "total_cost" = ?, "updated_at" = ? WHERE "owned_stocks"."id" = ?  [["shares_owned", 37], ["total_cost", 370.0], ["updated_at", "2022-07-22 19:24:40.850094"], ["id", 1]]
---
  def buy_stock

    @owned_stock = OwnedStock.find_by id: params[:owned_stock][:id]
    if @owned_stock
      @owned_stock.shares_owned = params[:owned_stock][:purchased].to_i + @owned_stock.shares_owned.to_i
      @owned_stock.total_cost = @owned_stock.shares_owned * @owned_stock.stock.price
      @owned_stock.save

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def sell_stock

    @owned_stock = OwnedStock.find_by id: params[:owned_stock][:id]

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_owned_stock
      @owned_stock = OwnedStock.find(params[:id])