stock_app/app/controllers/owned_stocks_controller.rb

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."stock_id" = ? AND "owned_stocks"."user_id" = ? LIMIT ?  [["stock_id", 1], ["user_id", 3], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "owned_stocks" SET "shares_owned" = ?, "updated_at" = ? WHERE "owned_stocks"."id" = ?  [["shares_owned", 13], ["updated_at", "2022-07-22 02:56:54.391983"], ["id", 1]]
INSERT INTO "owned_stocks" ("user_id", "ticker", "shares_owned", "total_cost", "created_at", "updated_at", "stock_id", "current_value") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "owned_stocks" ("user_id", "ticker", "shares_owned", "created_at", "updated_at", "stock_id") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["ticker", "test"], ["shares_owned", 0], ["created_at", "2022-07-22 23:58:12.521207"], ["updated_at", "2022-07-22 23:58:12.521207"], ["stock_id", 1]]
INSERT INTO "transactions" ("ticker", "action", "shares", "user_id", "created_at", "updated_at", "stock_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["ticker", "test"], ["action", "buy"], ["shares", 0], ["user_id", 3], ["created_at", "2022-07-26 14:57:56.413434"], ["updated_at", "2022-07-26 14:57:56.413434"], ["stock_id", 1]]
---
  def buy
    @owned_stock = OwnedStock.find_by stock_id: params[:id], user_id: current_user.id
    unless @owned_stock
      # creates new owned stock
      @owned_stock = OwnedStock.new stock_id: params[:id], user_id: current_user.id, ticker: Stock.find(params[:id]).ticker,
                                    shares_owned: 0, current_value: 0, total_cost: 0
      @owned_stock.save
    end
    @transaction = Transaction.new ticker: @owned_stock.ticker, action: "buy", shares: 0, user_id: current_user.id, stock_id: params[:id]
    @transaction.save

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."stock_id" = ? AND "owned_stocks"."user_id" = ? LIMIT ?  [["stock_id", 2], ["user_id", 3], ["LIMIT", 1]]
INSERT INTO "transactions" ("ticker", "action", "shares", "user_id", "created_at", "updated_at", "stock_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["ticker", "Goog"], ["action", "sell"], ["shares", 0], ["user_id", 3], ["created_at", "2022-07-26 14:59:19.939267"], ["updated_at", "2022-07-26 14:59:19.939267"], ["stock_id", 2]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def sell
    @owned_stock = OwnedStock.find_by stock_id: params[:id], user_id: current_user.id
    if @owned_stock && @owned_stock.shares_owned > 0
      @transaction = Transaction.new ticker: @owned_stock.ticker, action: "sell", shares: 0, user_id: current_user.id, stock_id: params[:id]
      @transaction.save
    else
      @stock = Stock.find params[:id]

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."ticker" = ? AND "owned_stocks"."user_id" = ? LIMIT ?  [["ticker", "test"], ["user_id", 3], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 232], ["LIMIT", 1]]
UPDATE "transactions" SET "shares" = ?, "time" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["shares", 1], ["time", "2022-07-23 17:10:15.209286"], ["updated_at", "2022-07-23 17:10:15.212562"], ["id", 25]]
UPDATE "users" SET "updated_at" = ?, "liquidcash" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-23 17:10:46.188841"], ["liquidcash", 5490.0], ["id", 3]]
UPDATE "owned_stocks" SET "shares_owned" = ?, "total_cost" = ?, "updated_at" = ?, "current_value" = ? WHERE "owned_stocks"."id" = ?  [["shares_owned", 48], ["total_cost", 528.0], ["updated_at", "2022-07-26 14:57:58.976547"], ["current_value", 1632.0], ["id", 6]]
UPDATE "transactions" SET "shares" = ?, "time" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["shares", 2], ["time", "2022-07-26 14:57:59.008737"], ["updated_at", "2022-07-26 14:57:59.020393"], ["id", 232]]
UPDATE "users" SET "updated_at" = ?, "liquidcash" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-26 14:57:59.047073"], ["liquidcash", 252.0], ["id", 3]]
UPDATE "owned_stocks" SET "shares_owned" = ?, "total_cost" = ?, "updated_at" = ? WHERE "owned_stocks"."id" = ?  [["shares_owned", 17], ["total_cost", 170.0], ["updated_at", "2022-07-23 17:16:46.850642"], ["id", 6]]
---
  def buy_stock
    @owned_stock = OwnedStock.find_by ticker: params[:transaction][:ticker], user_id: current_user.id
    @transaction = Transaction.find params[:transaction][:id]

    # throws error if trying to purchase 0 or less
    if params[:transaction][:shares].to_i <= 0
      respond_to{|format| format.html{redirect_to :buy, alert: "Invalid Entry: Cannot purchase less than 1 share"}}
      return
    end

    # updates database according to form
    current_user.liquidcash = current_user.liquidcash - params[:transaction][:shares].to_f * @owned_stock.stock.price.to_f
      if current_user.valid?
        @owned_stock.update shares_owned: params[:transaction][:shares].to_i + @owned_stock.shares_owned.to_i,
                            current_value: (params[:transaction][:shares].to_i + @owned_stock.shares_owned.to_i) * @owned_stock.stock.price,
                            total_cost: @owned_stock.total_cost + params[:transaction][:shares].to_i * @owned_stock.stock.price
        @transaction.update shares: params[:transaction][:shares], time: DateTime.now
        @transaction.save
        current_user.save
        @owned_stock.save
        respond_to{|format| format.html { redirect_to owned_stock_url(@owned_stock), notice: "Purchase Successfully Completed" } }
      else
        # Throws error if not enough liquid cash to complete order
        respond_to{|format| format.html { redirect_to :buy, alert: current_user.errors.messages.first[1][0]}}

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."ticker" = ? AND "owned_stocks"."user_id" = ? LIMIT ?  [["ticker", "Goog"], ["user_id", 3], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 233], ["LIMIT", 1]]
UPDATE "transactions" SET "shares" = ?, "time" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["shares", 2], ["time", "2022-07-23 17:37:00.569051"], ["updated_at", "2022-07-23 17:37:00.573719"], ["id", 31]]
UPDATE "users" SET "updated_at" = ?, "liquidcash" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-23 17:37:00.584302"], ["liquidcash", 5680.0], ["id", 3]]
UPDATE "owned_stocks" SET "shares_owned" = ?, "total_cost" = ?, "updated_at" = ?, "current_value" = ? WHERE "owned_stocks"."id" = ?  [["shares_owned", 80], ["total_cost", 8000.0], ["updated_at", "2022-07-26 14:59:23.404209"], ["current_value", 8000.0], ["id", 7]]
UPDATE "transactions" SET "shares" = ?, "time" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["shares", 5], ["time", "2022-07-26 14:59:23.427372"], ["updated_at", "2022-07-26 14:59:23.439597"], ["id", 233]]
UPDATE "users" SET "updated_at" = ?, "liquidcash" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-26 14:59:23.456107"], ["liquidcash", 752.0], ["id", 3]]
---
  def sell_stock
    @owned_stock = OwnedStock.find_by ticker: params[:transaction][:ticker], user_id: current_user.id
    @transaction = Transaction.find params[:transaction][:id]
    if params[:transaction][:shares].to_i <= 0
      respond_to{|format| format.html{redirect_to :sell, alert: "Invalid Entry: Cannot sell less than 1 share"}}
      return
    end
      @owned_stock.shares_owned = @owned_stock.shares_owned.to_i - params[:transaction][:shares].to_i
      # saves to database if sold stocks <= owned stocks, throws error otherwise
      if @owned_stock.valid?
        @owned_stock.update current_value: @owned_stock.shares_owned * @owned_stock.stock.price,
                            total_cost: @owned_stock.total_cost.to_f - params[:transaction][:shares].to_f * @owned_stock.stock.price
        @transaction.update shares: params[:transaction][:shares], time: DateTime.now
        @transaction.save
        current_user.liquidcash = current_user.liquidcash + params[:transaction][:shares].to_f * @owned_stock.stock.price.to_f
        current_user.save

UPDATE "owned_stocks" SET "user_id" = ?, "total_cost" = ?, "updated_at" = ? WHERE "owned_stocks"."id" = ?  [["user_id", 1], ["total_cost", 200.0], ["updated_at", "2022-07-22 02:58:31.185590"], ["id", 1]]
---
  def update
    form_params = owned_stock_params
    stock_params = {:shares_owned => @owned_stock.shares_owned.to_i + form_params[:shares_owned].to_i, :ticker => @owned_stock.ticker}
    respond_to do |format|
      if @owned_stock.update(owned_stock_params)

DELETE FROM "owned_stocks" WHERE "owned_stocks"."id" = ?  [["id", 1]]
---
  def destroy
    @owned_stock.destroy

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."ticker" = ?  [["ticker", "GOOGL"]]
---
  def self.update_price ticker, old_price, new_price
    impacted_users = []
    OwnedStock.where(:ticker => ticker).each {|owned_stock| impacted_users.push owned_stock.update_price(new_price) }

SELECT "owned_stocks".* FROM "owned_stocks" WHERE "owned_stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_owned_stock
      @owned_stock = OwnedStock.find(params[:id])