stock_app/app/controllers/stocks_controller.rb

  def self.price_change ticker, new_price
    # Update stock
    StocksHelper.GeneralNews
    stock_record = Stock.find_by ticker: ticker
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."ticker" = ? LIMIT ?  [["ticker", "BINANCE:BTCUSDT"], ["LIMIT", 1]]

    def set_stock
      @stock = Stock.find(params[:id])
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]