stock_app/app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
UPDATE "users" SET "updated_at" = ?, "initialbalance" = ?, "currentbalance" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-26 15:56:35.035518"], ["initialbalance", 101.0], ["currentbalance", 101.0], ["id", 9]]
UPDATE "users" SET "updated_at" = ?, "initialbalance" = ?, "currentbalance" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-27 04:10:36.871001"], ["initialbalance", 74553161.0], ["currentbalance", 74553161.0], ["id", 11]]
---
  def index
    @stocks = Stock.all
    if current_user.currentbalance.nil? && current_user.initialbalance.nil?
      current_user.update currentbalance: current_user.liquidcash, initialbalance: current_user.liquidcash
      current_user.save

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @stock = Stock.find(params[:id])

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def trade
    @stock = Stock.find(params[:id])

INSERT INTO "stocks" ("ticker", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ticker", "Goog"], ["price", 100.0], ["created_at", "2022-07-22 03:01:05.122257"], ["updated_at", "2022-07-22 03:01:05.122257"]]
---
  def create
    @stock = Stock.new(stock_params)

    respond_to do |format|
      if @stock.save

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_stock
      @stock = Stock.find(params[:id])