stock_app/app/controllers/transactions_controller.rb

DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 1]]
---
  def destroy
    @transaction.destroy